Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ЛичныеСообщенияПользователейСУО/ЛичныеСообщенияПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛичныеСообщенияПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОтправительИлиПолучатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГрупповоеОбсуждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправленное</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СообщенияТемСУО/СообщенияТемСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияТемСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ТемыМодераторовСУО/ТемыМодераторовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТемыМодераторовСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ТемыПользователейСУО/ТемыПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТемыПользователейСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАвтор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГрупповоеОбсуждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/МодераторыОбщенияСУО/МодераторыОбщенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МодераторыОбщенияСУО</name>
  <dimensions>
    <name>Модератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/РазделыФорумаСУО/РазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыФорумаСУО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Модератор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Documents/СообщениеСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем ДанныеОТеме;	

#КонецОбласти	

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Заполняем переменные модуля
	//
	
	ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Контекст, Кому, Автор, ДатаСоздания, ДополнительныеПолучатели, ИсключенныеПолучатели, Наименование, Закрыта");
	
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	// Делаем проверки
	//
	
	Если ЭтоНовый() И НЕ ПервоеСообщениеВТеме Тогда
		
		Если ДанныеОТеме.Закрыта Тогда
			
			ТекстСообщения = НСтр("ru = 'Тема закрыта для новых сообщений'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполняем рекизиты
	//
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЛичныеСообщенияПользователейСУО.Записывать = Истина;
	Движения.СообщенияТемСУО.Записывать = Истина;
	Движения.ТемыМодераторовСУО.Записывать = Истина;
	Движения.ТемыПользователейСУО.Записывать = Истина;
	
	// Помечаем шаблон как действующий
	
	Если ЗначениеЗаполнено(Шаблон)
		И ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныСообщенийСУО")
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "Действующий") Тогда
		
		ШаблонОбъект = Шаблон.ПолучитьОбъект();
		ШаблонОбъект.Действующий = Истина;
		ШаблонОбъект.Записать();
		
	КонецЕсли;
	
	Если НЕ ТолькоЭлектроннаяПочта И НЕ УдаленоМодератором Тогда
		
		ЭтоГрупповоеОбсуждение     = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(ДанныеОТеме.Кому);
		МассивПолучателейСообщения = Документы.СообщениеСУО.ПолучателиСообщения(ДанныеОТеме);
		КоличествоПолучателей      = МассивПолучателейСообщения.Количество();
		
		// Проводки по регистру СообщенияТемСУО
		
		Движение = Движения.СообщенияТемСУО.Добавить();
		Движение.Период                  = Дата;
		Движение.Тема                    = Тема;
		Движение.Номер                   = Номер;
		Движение.Пользователь            = Пользователь;
		Движение.Шаблон                  = Шаблон;
		Движение.РодительскоеСообщение   = РодительскоеСообщение;
		
		Если ЭтоГрупповоеОбсуждение Тогда
			Движение.РазделФорума = ДанныеОТеме.Контекст;	
		КонецЕсли;
		
		ТекстСообщенияОбработанный = Документы.СообщениеСУО.ФорматированныйДокументСообщения(Ссылка);
		Движение.ФорматированныйДокумент =  Новый ХранилищеЗначения(ТекстСообщенияОбработанный, Новый СжатиеДанных(9));
		
		// Проводки по регистру ЛичныеСообщенияПользователейСУО
		
		Если НЕ ЭтоГрупповоеОбсуждение И КоличествоПолучателей >= 2 Тогда
			
			ПолучательСообщения = Документы.СообщениеСУО.ПолучательЛичногоСообщения(Пользователь, МассивПолучателейСообщения);
			
			ЕстьВложения = Документы.СообщениеСУО.ЕстьВложения(Ссылка);
			
			// Входящие
			
			Движение = Движения.ЛичныеСообщенияПользователейСУО.Добавить();
			Движение.Период                   = Дата;
			Движение.Пользователь             = ПолучательСообщения; // Получатель
			Движение.Отправленное             = Ложь;
			
			Движение.Тема                     = Тема;
			Движение.ОтправительИлиПолучатель = Пользователь; // Отправитель	
			Движение.ЕстьВложения             = ЕстьВложения;
			
			// Исходящее
			
			Движение = Движения.ЛичныеСообщенияПользователейСУО.Добавить();
			Движение.Период                   = Дата;
			Движение.Пользователь             = Пользователь; // Отправитель
			Движение.Отправленное             = Истина;
			
			Движение.Тема                     = Тема;
			Движение.ОтправительИлиПолучатель = ПолучательСообщения; // Получатель	
			Движение.ЕстьВложения             = ЕстьВложения;
			
		КонецЕсли;
		
		// Проводки по регистру ТемыМодераторовСУО
		
		Если ПервоеСообщениеВТеме И ЭтоГрупповоеОбсуждение Тогда
			
			МассивМодераторов = Новый Массив();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МодераторыОбщенияСУО.Модератор КАК Модератор
			|ИЗ
			|	РегистрСведений.МодераторыОбщенияСУО КАК МодераторыОбщенияСУО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РазделыФорумаСУОВидимость.Пользователь КАК Модератор
			|ИЗ
			|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
			|ГДЕ
			|	РазделыФорумаСУОВидимость.Ссылка = &РазделФорума
			|	И РазделыФорумаСУОВидимость.Модератор = ИСТИНА";
			
			Запрос.УстановитьПараметр("РазделФорума", ДанныеОТеме.Контекст);
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			Для каждого Результат Из МассивРезультатов Цикл
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если МассивМодераторов.Найти(ВыборкаДетальныеЗаписи.Модератор) = Неопределено Тогда
						МассивМодераторов.Добавить(ВыборкаДетальныеЗаписи.Модератор);		
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			Для каждого Модератор Из МассивМодераторов Цикл
				
				Движение = Движения.ТемыМодераторовСУО.Добавить();
				
				Движение.Пользователь = Модератор;
				Движение.Тема         = Тема;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Движения по регистру ТемыПользователейСУО 
		
		Если ПервоеСообщениеВТеме Тогда
			
			Для каждого ПолучательСообщения Из МассивПолучателейСообщения Цикл
				
				Движение = Движения.ТемыПользователейСУО.Добавить();
				
				Движение.Пользователь = ПолучательСообщения;
				Движение.Тема         = Тема;				
				
				Движение.Кому         = ДанныеОТеме.Кому;
				Движение.Контекст     = ДанныеОТеме.Контекст;
				Движение.ДатаСоздания = ДанныеОТеме.ДатаСоздания;
				Движение.ЭтоАвтор     = ?(ДанныеОТеме.Автор = ПолучательСообщения, Истина, Ложь);				
				Движение.Рассылка     = Рассылка;				
				Движение.Закрыта      = ДанныеОТеме.Закрыта;
				
				Движение.ЭтоГрупповоеОбсуждение = ЭтоГрупповоеОбсуждение;
				
			КонецЦикла;			
			
		КонецЕсли;
		
	КонецЕсли; // НЕ ТолькоЭлектроннаяПочта	
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// {{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
		// Заполнение шапки
		Шаблон = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПеременные Из ДанныеЗаполнения.Переменные Цикл
			НоваяСтрока = ЗначенияПеременных.Добавить();
			НоваяСтрока.Переменная = ТекСтрокаПеременные.Переменная;
		КонецЦикла;
	КонецЕсли;
	// }}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

#КонецОбласти


#КонецЕсли
